{
  "articles": [
    {
      "id": 1,
      "title": "Evaluación de la accesibilidad de los gráficos estadísticos de Covid-19 de los gobiernos y organizaciones de la salud para personas con baja visión",
      "briefing": "La mayor parte de información proporcionada a lo largo de la pandemia ayudó a reducir la propagación del virus. En este estudio se comprobará la accesibilidad de los gráficos usados por el gobierno brasileño, británico, español y europeo, así como por la organización mundial de la salud, y la universidad Johns Hopkins...",
      "date": "11 junio 2020",
      "abstract":[
        "During the Covid-19 pandemic, people rely on the Internet in order to obtain information that can help them understand the coronavirus crisis. This situation has exposed the need to ensure that everyone has access to essential information on equal terms. During this situation, statistical charts have been used to display data related to the pandemic, and have had an important role in conveying, clarifying and simplifying information provided by governments and health organisations. Scientific literature and the guidelines published by organizations have focused on proposing solutions to make charts accessible for blind people or people with very little visual rest. However, the same efforts are not made towards people with low vision, despite their higher prevalence in the population of users with visual impairment. This paper reviews the accessibility of the statistical charts about the Covid-19 crisis for people with low vision that were published by the Brazilian, British, Russian, Spanish, European Union, and the United States’ governments and also by the World Health Organization and Johns Hopkins University, relating to the countries most severely affected by the pandemic. The review is based on specific heuristic indicators, with a mixed quantitative and qualitative approach. Overall, the reviewed charts offer a reasonable level of accessibility, although there are some relevant problems affecting many of the low vision profiles that remain to be solved. The main problems identified are: poor text alternatives in both, raster images and SVG charts; the incompatibility with a keyboard interface; insufficient non-text contrast against adjacent colours (in chart elements such as bars, lines or areas), no customization options; and the lack of an optimized print version for users for whom reading on screen is challenging."
      ],
      "image": "https://1.bp.blogspot.com/-S7Ul6H7CDds/XqsCHUtuh5I/AAAAAAAAOis/9JFES3OiPAMZ_AC3EyzVbUDXZU-DN6TcwCEwYBhgL/s1600/Imagen1.png"
    },
    {
      "id": 2,
      "title": "Accesibilidad para personas con baja visión de los gráficos estadísticos en la prensa digital: una propuesta metodológica basada en indicadores heurísticos",
      "briefing": "Estudio que evalúa la accesibilidad de los gráficos proporcionados por la prensa digital y diversos medios de comunicación nacionales e internacionales mediante unas heurísticas dirigidas a las personas con baja visión y visión cromática deficiente (VCD)...",
      "date": "11 abril 2020",
      "abstract": [
        "Se presenta un nuevo conjunto de indicadores heurísticos para la evaluación de la accesibilidad de los gráficos estadísticos para personas con baja visión y visión cromática deficiente (VCD), así como un método para su aplicación. Con el objetivo de validar la propuesta, se ha realizado una evaluación heurística de la accesibilidad de 35 gráficos publicados en 5 diarios españoles y 2 internacionales. Los resultados muestran que los indicadores propuestos consiguen detectar una mayor cantidad de problemas únicos, presentan una mejor distribución de los problemas entre heurísticos y consiguen detectar problemas más severos y específicos que las Web content accessibility guidelines (WCAG). En relación con los problemas detectados, destaca la prácticamente nula presencia de alternativas textuales en los gráficos publicados como imágenes en formato de mapa de bits, un problema que también se da en el caso de los gráficos publicados en formato SVG, donde destaca el nulo etiquetado de las marcas con estándares como WAI-ARIA. En estos últimos también se observa el pobre uso de indicadores para remarcar los elementos que reciben el foco, o su inaccesibilidad mediante una interfaz de teclado. Otros problemas comunes en ambos tipos de gráficos son la ratio de contraste entre elementos no textuales, por debajo en muchos casos del mínimo requerido, un tamaño de fuente demasiado pequeño o la no sistematización del uso de paletas de colores seguras para personas con VCD. Por lo que respecta a la comparación entre medios nacionales e internacionales, si bien las puntuaciones obtenidas por los internacionales son superiores, éstos comparten"
      ],
      "image": "https://1.bp.blogspot.com/-S7Ul6H7CDds/XqsCHUtuh5I/AAAAAAAAOis/9JFES3OiPAMZ_AC3EyzVbUDXZU-DN6TcwCEwYBhgL/s1600/Imagen1.png"
    },
    {
      "id": 3,
      "title": "Los gráficos son parte de la ecuación en publicaciones accesibles: Una evaluación heurística de las publicaciones de LIS mas relevantes.",
      "briefing": "Los gráficos estadísticos tienen un papel clave en los trabajos académicos, ya que se usan para reflejar o mostrar de manera clara los resultados de la investigación realizada por sus autores, sin embargo, presentan algunas barreras para personas con baja visión. En este articulo se realiza una evaluación de la accesibilidad de los gráficos estadísticos usados en los artículos con mayor relevancia)...",
      "date": "11 marzo 2021",
      "abstract": [
        "Purpose:  Statistical charts are an essential source of information in academic papers. Charts have an important role in conveying, clarifying and simplifying the research results provided by the authors, but they present some accessibility barriers for people with low vision. This article aims to evaluate the accessibility of the statistical charts published in the library and information science (LIS) journals with the greatest impact factor.", "Design/methodology/approach:   A list of heuristic indicators developed by the authors has been used to assess the accessibility of statistical charts for peoplewith lowvision. The heuristics have been applied to a sample of charts from 2019 issues of ten LIS journals with the highest impact factor according to the ranking of the JCR.",
        "Findings:   The current practices of image submission do not follow the basic recommended guidelines on accessibility like color contrast or the use of textual alternatives. On the other hand, some incongruities between the technical suggestions of image submission and their application in analyzed charts also emerged. The main problems identified are: poor text alternatives, insufficient contrast ratio between adjacent colors and the inexistence of customization options. Authoring tools do not help authors to fulfill these requirements.",
        "Research limitations/implications:   The sample is not very extensive; nonetheless, it is representative of common practices and the most frequent accessibility problems in this context.",
        "Social implications:   The heuristics proposed are a good starting point to generate guidelines for authors when preparing their papers for publication and to guide journal publishers in creating accessible documents. Low-vision users, a highly prevalent condition, will benefit from the improvements.",
        "Originality/value:   The results of this research provide key insights into low-vision accessibility barriers, not considered in previous literature and can be a starting point for their solution.",
        "Keywords Accessibility, Low vision, Color blindness, Statistical charts, Journals, Scientific papers, Heuristic evaluation",
        "Paper type:  Research paper"
      ],
      "image": "https://1.bp.blogspot.com/-S7Ul6H7CDds/XqsCHUtuh5I/AAAAAAAAOis/9JFES3OiPAMZ_AC3EyzVbUDXZU-DN6TcwCEwYBhgL/s1600/Imagen1.png"
      },
      {
        "id": 4,
        "title": "Gráficos estadísticos accesibles para personas con baja visión y visión cromática deficiente",
        "briefing": "Los gráficos estadísticos tienen un papel crucial en diferentes áreas de nuestra vida diaria, como la información, educación, comunicación o investigación. A pesar de ello, los autores y publicadores de contenido no siempre tienen en cuenta el criterio de la accesibilidad durante el desarrollo de este tipo de contenidos. Este estudio remarca la importancia de tener en cuenta este criterio, además de incluir un acercamiento de como la literatura científica aborda este tema...",
        "date":"28 junio 2019",
        "abstract": [
          "Statistical charts play a primordial role in different areas of our life, such as information, education, communication or research. However, authors and content publishers do not always follow the accessibility criteria in the design and creation of this type of content. Considering these premises, this work includes the main approaches in which the scientific literature has focused so far to improve the accessibility of statistical charts: text alternatives, sonification, tactile alternatives and multimodal alternatives, with the purpose of evaluating their suitability for people with low vision and color blindness. Finally, some solutions are suggested that seem technologically viable and that start from the use of JavaScript libraries for the creation of interactive charts, in combination with other standards such as WAI-ARIA and the use of patterns to fill areas as a strategy to differentiate visual variables."
        ],
        "image": "https://1.bp.blogspot.com/-S7Ul6H7CDds/XqsCHUtuh5I/AAAAAAAAOis/9JFES3OiPAMZ_AC3EyzVbUDXZU-DN6TcwCEwYBhgL/s1600/Imagen1.png"
      }
  ],
  "authors": [
      {
      "id": "1",
      "name":"Rubén Alcaraz Martínez",
      "photo":"https://www.ub.edu/adaptabit/img/rubenalcaraz.jpg",
      "mail": "mailto:ralcaraz@ub.edu"
      },
      {
      "id": "2",
      "name":"Mireia Ribera-Turró",
      "photo":"https://i1.rgstatic.net/ii/profile.image/700516204048387-1544027486191_Q512/Mireia-Ribera-Turro.jpg",
      "mail": "ribera@ub.edu"
      },
      {
      "id": "3",
      "name":"Toni Granollers-Saltiveri",
      "photo":"https://www.directorioexit.info/exit/fotos/200/5919.jpg",
      "mail": ""
      }
    ]
}
