{
  "introduction" : [
    {
      "title": "Introducción",
      "paragraphs":
          [
              "En las últimas dos décadas se ha observado una creciente presencia de los medios de comunicación en la Red y, en concreto, de la prensa escrita, una cuestión que ha llevado a diversos autores y entidades a realizar trabajos orientados a evaluar la usabilidad y accesibilidad de la prensa digital, así como a proponer pautas y criterios para la creación de contenido audiovisual accesible en la Web. No obstante, ningún trabajo hasta el momento se ha centrado en el análisis de la accesibilidad de los gráficos estadísticos presentes en estos medios, limitándose los estudios existentes a evaluar de manera genérica la presencia de alternativas textuales para el contenido no textual, como criterio incluido en las Web content accessibility guidelines (WCAG) del World Wide Web Consortium (2018a).",
              "En el caso particular de los gráficos estadísticos, la bibliografía científica se ha centrado en estudiar su accesibilidad para las personas ciegas o con muy poco resto de visión. Fundamentalmente, se han propuesto cuatro aproximaciones en vistas a mejorar su accesibilidad: ",
              "- el uso de alternativas textuales, ",
              "- la generación de alternativas táctiles, ",
              "- la implementación de esquemas sonoros, y ",
              "- la creación de presentaciones multimodales.",
              "Si bien estas aproximaciones pueden ser útiles para las personas ciegas e incluso para los usuarios con baja visión severa, al centrarse en alternativas diferentes a la gráfica como tablas de datos estructurados, resúmenes o el uso de sonidos para comunicar tendencias, no presentan la misma capacidad para mostrar de una manera eficiente tendencias o comparativas entre variables. Esto implica además un mayor uso de la memoria a corto plazo y una superior carga cognitiva cuando se busca obtener respuestas o conclusiones a partir de datos tabulados. No debemos olvidar que un importante porcentaje de usuarios con baja visión todavía conserva un resto de visión suficiente para visualizar los gráficos, ya sea simplemente ampliándolos, o gracias al soporte de ayudas técnicas como los magnificadores de pantalla, y que estas personas prefieren usar ese resto visual en su día a día (Szpiro et al., 2016), condición que las alternativas mencionadas no explotan.",
              "En la figura 1, se puede observar un ejemplo de la diferencia entre la lectura de los mismos datos reprensentados en forma de tabla y gráfico."
          ],
          "innerHtml": "<table class='table'><thead><tr><th scope='col'></th><th scope='col'>Ene</th><th scope='col'>Feb</th><th scope='col'>Mar</th><th scope='col'>Abr</th><th scope='col'>May</th><th scope='col'>Jun</th><th scope='col'>Jul</th><th scope='col'>Ago</th><th scope='col'>Sep</th><th scope='col'>Oct</th><th scope='col'>Nov</th><th scope='col'>Dic</th></tr></thead><tbody><tr><th scope='row'>2013</th><td>17.589</td><td>24.156</td><td>27.165</td><td>29.541</td><td>32.146</td><td>24.563</td><td>14.743</td><td>16.230</td><td>15.636</td><td>19.999</td><td>31.545</td><td>18.354</td></tr><tr><th scope='row'>2014</th><td>22.895</td><td>26.746</td><td>32.565</td><td>31.050</td><td>35.241</td><td>26.124</td><td>16.923</td><td>17.028</td><td>22.712</td><td>27.351</td><td>26.558</td><td>16.607</td></tr><tr><th scope='row'>2015</th><td>18.729</td><td>23.027</td><td>26.966</td><td>25.407</td><td>28.548</td><td>25.197</td><td>19.885</td><td>18.207</td><td>28.065</td><td>32.033</td><td>30.104</td><td>18.817</td></tr></tbody></table>",
          "innerHtmlCanvas": true
  },
  {
    "title": "Presencia de los gráficos estadísticos en nuestro día a día",
    "paragraphs": [
      "Los gráficos estadísticos están presentes en todos los sectores clave de la sociedad. En el ámbito educativo, se pretende conseguir que los estudiantes sean capaces de interpretar y crear diferentes tipos de gráficos estadísticos en distintas materias. En el ámbito científico, la representación gráfica es una de las principales formas a través de las cuales se comunican los resultados de investigación. En el caso de los medios de comunicación, la prensa siempre se ha valido de gráficos para representar datos y estadísticas.",
      "Según datos de la Organización Mundial de la Salud (World Health Organization, 2019), alrededor de 1.300 millones de personas en el mundo presentan algún tipo de discapacidad visual, de las cuales el 95% presentan algún tipo de baja visión. La prevalencia a nivel mundial, tomando como referencia los datos de población del último informe demográfico de la División de Población de las Naciones Unidas (2017), es de alrededor del 17,1%.",
      "Se considera que una persona presenta baja visión cuando con la mejor corrección óptica posible, su agudeza visual es inferior a 20/60, o su campo de visión es inferior a 20 grados. Una agudeza visual “normal” es la de las personas que obtienen un resultado de 20/20 en el test de Snellen y su campo visual es de 90 grados a ambos lados y 50 grados por encima y 60 por debajo de la nariz. Esto implica que dentro de este perfil de usuario podemos encontrar tanto a perso nas con una agudeza visual que va desde el reconocimiento de la forma de una mano, hasta un 2/60 en el test Snellen, combinado o no con un campo visual de menos de 5 grados (B2 en la clasificació IBSA), como a personas con un resto de visión situado entre 2/60 y 6/60 en el mismo test y/o un campo visual de entre 5 y 20 grados (B3 en la clasificación IBSA). También a personas con problemas no sólo relacionados con la agudeza visual o el campo de visión, sino también con la sensibilidad a la luz, al contraste –no sólo entre texto o imagen respecto al fondo, sino también entre elementos adyacentes– , o con dificultad o imposibilidad para diferenciar colores (conocida como visión cromática deficien te, en adelante VCD). En este sentido, la gran variabilidad presente en este perfil de usuario implica grandes diferencias en las capacidades en tredos personas con baja visión, así como en las estrategias,preferencias y ayudas técnicas (lectores de pantalla, magnificadores, opciones de contraste, etc.) utilizadas para acceder al contenido disponible en las webs.",
      "Ante la inexistencia de principios específicos para evaluar la accesibilidad para personas con baja visión de los gráficos estadísticos disponibles en la Web, se ha creado un nuevo método basado en heurísticas. Las evaluaciones heurísticas son métodos de inspección de una o varias dimensiones clave de una interfaz. En este tipo de revisiones, muy extendidas en el ámbito de la usabilidad y la accesibilidad, varios expertos se valen de su experiencia y se basan en su propio juicio para examinar la interfaz en base a una serie de principios denominados indicadores heurístico.",
      "Frente a la posibilidad de recopilar y presentar una guía de buenas prácticas para la creación de gráficos estadísticos accesibles, se ha optado por la creación de un conjunto de indicadores heurísticos. Estos indicadores se pueden utilizar tanto para la evaluación, como para la posterior creación de guías específicas, con el objetivo de dar a conocer los requisitos de accesibilidad aplicables entre autores y diseñadores. El presente trabajo busca pues dos objetivos. En primer lugar, conocer el grado de adecuación de los gráficos estadísticos presentes en la prensa digital a las características de accesibilidad requeridas por parte de las personas con baja visión o VCD, a partir de una muestra extraída de los medios de máxima difusión. En segundo lugar, se pretende validar la propuesta de indicadores heurísticos en términos de eficacia, con el objetivo de obtener un conjunto de indicadores que sirva tanto para la evaluación, como para la elaboración de guías de buenas prácticas"
    ]
  },
  {
      "title": "Planteamiento y ejecución de la evaluación",
      "paragraphs":[
          "Los resultados del trabajo de Nielsen (1992) muestran la necesidad de involucrar a varios evaluadores para poder encontrar todos los problemas presentes en la interfaz. Su recomendación es que participen entre 3 y 5 evaluadores, ya que añadir personas adicionales al proceso implica una relación entre beneficios y coste difícilmente justificable por el pobre incremento en la cantidad de errores descubiertos. En este caso se ha contado con 4 evaluadores, todos ellos con experiencia previa en evaluaciones heurísticas, auditorías de accesibilidad y en el trabajo con usuarios con baja visión.",
          "El proceso de evaluación tuvo lugar entre los días 5 y 13 de octubre de 2019. Cada evaluador trabajó de manera individual con el objetivo de garantizar evaluaciones independientes e imparciales. Una vez finalizado el proceso y, siguiendo las recomendaciones de Nielsen (1994), se llevó a cabo una reunión en la que los evaluadores pudieron comunicarse y agregar sus hallazgos con el objetivo de poner en común aspectos relacionados tanto con los problemas encontramos en la interfaz, como con los mismos indicadores heurísticos",
          "La lista de indicadores heurísticos propuesta está formada por 18 indicadores que cubren aspectos de la información que transmite el gráfico (título, ejes, alternativas de texto…), su presentación visual (fuente tipográfica, colores…) y el comportamiento y funciones presentes (personalización, compatibilidad con los lectores de pantalla…).",
          "En relación con el perfil de baja visión al que benefician, la distribución de los indicadores es la siguiente:",
          "- 3 indicadores pensados para usuarios que presentan un resto visual muy bajo y que emplean un lector de pantalla como ayuda técnica principal o como complemento al magnificador de pantalla;",
          "- 5 indicadores que contemplan aspectos que pueden beneficiar a usuarios con un resto visual no tan bajo como el anterior, pero que aun así precisan del uso de ayudas como magnificadores de pantalla; ",
          "- 1 indicador pensado para satisfacer las necesidades de los usuarios con VCD; ",
          "- 1 indicador que cubre la sensibilidad al contraste; y ",
          "- 8 indicadores de carácter más general que constituyen buenas prácticas que benefician a cualquier tipo de lector."
      ]

  }
  ]
}
